{
  "themes" : [
       "Linear and Non-linear Optimization",
       "Combinatorial Optimization",
       "Optimization Algorithms and Applications",
       "Heuristics and Metaheuristics",
       "Multi-objective Optimization",
       "Optimization for Machine Learning",
       "Optimization for Sustainability",
       "Optimization and Learning under uncertainty",
       "Fixed Point Theory",
       "Nonlinear Analysis",
       "Fractals",
       "Dynamical Systems/Mathematical Modelling",
       "Soft Computing/Decision Making",
       "Variational Inequalities",
       "Numerical Analysis and Discrete Mathematics"
    ],
  "places":[
    {
    "name": "Jwala Devi Temple",
    "location": "Jwala Mukhi",
    "district": "Kangra",
    "details": "Jwala Ji or Jwala devi temple is one of the 51 Shaktipeeths of India and Jwala Ji Temple is one of the highly venerated Shakti Temples in India. It is situated in the lap of Shivalik range of Kangra valley called “Kalidhar”. This is believed to be the first ever temple built by the Pandavas. Jwala Ji is a Devi Temple Dedicated to the “GODDESS OF LIGHT”, located in Jwala Mukhi, district Kangra of Himachal Pradesh."
  },
  {
    "name": "Christ Church",
    "location": "Shimla",
    "district": "Shimla",
    "details": "The Christ Church in Shimla is the second one oldest church in complete northern India and is a site of natural devotion in addition to architectural beauty. It is designed in the neo-Gothic style. The church is lit at night to illuminate it. The church contains five fine stained glass windows. One represents the Christian virtues of Faith, Hope, Charity, Fortitude, Patience, and Humility. The church is a place of worship for hundreds of tourists and locals. The church is located on the Ridge and is a prominent landmark in Shimla."
  },
  {
    "name": "Jakhu Temple",
    "location": "Jakhu Hill",
    "district": "Shimla",
    "details": "Jakhu Temple is a significant temple in Shimla, Himachal Pradesh, situated on the Jakhu hill. The temple stands at the highest point of Shimla amidst the lush green backdrop of the Shivalik hill ranges."
  },
  {
    "name": "Hadimba Temple",
    "location": "Manali",
    "district": "Kullu",
    "details": "Hadimba Temple is an ancient cave temple dedicated to Hidimbi Devi, who was a character in the Indian epic, Mahabharata. The temple is surrounded by a cedar forest at the foot of the Himalayas. The sanctuary is built over a huge rock jutting out of the ground, which was worshiped as an image of the deity. The structure was built in 1553."
  },
  {
    "name": "Bhimakali Temple",
    "location": "Sarahan",
    "district": "Sirmour",
    "details": "The Bhimakali Temple is a temple at Sarahan in Himachal Pradesh in India, dedicated to the mother goddess Bhimakali, presiding deity of the rulers of former Bushahr State. The temple is situated about 180 km from Shimla and is one of 51 Shakti Peethas. The town Sarahan is known as the gateway of Kinnaur."
  }
  ]
}
